micropython/micropython/ports/stm32/spi.c
#ifdef SPIDMA_MODES
    // void led_toggle(int); /*void mp_hal_delay_ms(int);*/ while(1){led_toggle(1); mp_hal_delay_ms(500);}
#ifdef DEBUG_SPIDMA_MODES
    printf("\ncalling spi_deinit\n");
#endif

    const spi_t * _spi = spi_obj;
    SPI_DMAHandleTypeDef * dma_modes = _spi->dma_modes;
    if (dma_modes){
        bool callabort = false;
#ifdef DEBUG_SPIDMA_MODES
        printf("\ndma_modes->mode = %d\n",  (int) dma_modes->mode);
        printf("\ndma_modes->mode = %d\n",  (int) dma_modes->mode);
#endif

        if ((dma_modes->mode == SPI_CFG_MODE_NONBLOCKING) || (dma_modes->mode == SPI_CFG_MODE_CIRCULAR)){
            if (spi->hdmatx != NULL){
                dma_deinit(_spi->tx_dma_descr);
                spi->hdmatx = NULL; // So we know there is no longer a DMA in process
                callabort = true;
            }
            if (spi->hdmarx != NULL){
                dma_deinit(_spi->rx_dma_descr);
                spi->hdmarx = NULL;
                callabort = true;
            }
        }
        if (callabort){
#ifdef DEBUG_SPIDMA_MODES
            printf("\ncalling abort\n");
#endif
            mp_obj_t callback = dma_modes->callbackabort;
            if (callback != (mp_obj_t) NULL){
                mp_obj_t get_mp_spi_id_from_Instance(const SPI_TypeDef *Instance);

                SPI_TypeDef *Instance = spi->Instance;

                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
        }
    }
#endif
}

STATIC HAL_StatusTypeDef spi_wait_dma_finished(const spi_t *spi, uint32_t t_start, uint32_t timeout) {
    volatile HAL_SPI_StateTypeDef *state = &spi->spi->State;
    for (;;) {
        // Do an atomic check of the state; WFI will exit even if IRQs are disabled
        uint32_t irq_state = disable_irq();
        if (*state == HAL_SPI_STATE_READY) {
            enable_irq(irq_state);
            return HAL_OK;
        }
        __WFI();
        enable_irq(irq_state);
        if (HAL_GetTick() - t_start >= timeout) {
            return HAL_TIMEOUT;
        }
    }
    return HAL_OK;
}

/*
Problem: Where will the information for circular, callbackhalf, callbackfull, callbackerror get stored. Currently, spi_t holds all the STM32HAL SPI type of parameters.

I propose to modify struct _spi_t (in ports/stm32/spi.h) to add the following member:

typedef struct _spi_t {
    SPI_HandleTypeDef *spi;
    const dma_descr_t *tx_dma_descr;
    const dma_descr_t *rx_dma_descr;
    const dma_mode_t      *dma_mode; // Null if normal blocking behavior
} spi_t;

In order to add an optional DMA configuration structure. This will hold the DMA mode (CIRCULAR, callbackhalf, callbackfull, callbackerror). If NORMAL (default) is specified the dma_mode pointer would be NULL.

To support bigger parts, DMA mode could also include:
DUALBUFFER, etc.

Each of these modes would carry a union of parameters (some required, some optional) for each of the separate DMA modes. The definition of the union would be part specific depending upon the DMA modes supported and the settings in mpconfigport.h.
*/

#if SPIDMA_MODES
void spi_transfer_orig(const spi_t *self, size_t len, const uint8_t *src, uint8_t *dest, uint32_t timeout);
void spi_transfer_nonblocking(const spi_t *self, size_t len, const uint8_t *src, uint8_t *dest, uint32_t timeout);
void spi_transfer_circular(const spi_t *self, size_t len, const uint8_t *src, uint8_t *dest, uint32_t timeout);
mp_obj_t get_mp_spi_id_from_Instance(const SPI_TypeDef *Instance);

void spi_transfer(const spi_t *self, size_t len, const uint8_t *src, uint8_t *dest, uint32_t timeout)
{
    // XXXTODO check if a transfer is already in progress on this device. Error if already in progress.
    #ifdef DEBUG_SPIDMA_MODES
        printf("\nspi_transfer called\n");
    #endif

    SPI_HandleTypeDef * hspi = self->spi;
    if ((hspi->hdmatx != NULL) || (hspi->hdmarx != NULL))
    {
        SPI_TypeDef *Instance = self->spi->Instance;
        mp_obj_t callback;
        if ((callback = self->dma_modes->callbackerror) != (mp_obj_t) NULL){
            mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
        }
        mp_raise_msg(&mp_type_OSError, "spi_transfer failed. DMA operation already in progress");
        return;
    }

    if (self->dma_modes->mode == SPI_CFG_MODE_NORMAL)
    {
        #ifdef DEBUG_SPIDMA_MODES
            printf("\nspi_transfer_orig called\n");
        #endif

        spi_transfer_orig(self, len, src, dest, timeout);
    }
    else if (self->dma_modes->mode == SPI_CFG_MODE_NONBLOCKING)
    {
        spi_transfer_nonblocking(self, len, src, dest, timeout);
    }
    else
    {
        spi_transfer_circular(self, len, src, dest, timeout);
    }
}

void spi_transfer_orig(const spi_t *self, size_t len, const uint8_t *src, uint8_t *dest, uint32_t timeout) {
#else
void spi_transfer(const spi_t *self, size_t len, const uint8_t *src, uint8_t *dest, uint32_t timeout) {
#endif
    // Note: there seems to be a problem sending 1 byte using DMA the first
    // time directly after the SPI/DMA is initialised.  The cause of this is
    // unknown but we sidestep the issue by using polling for 1 byte transfer.

    // Note: DMA transfers are limited to 65535 bytes at a time.


    HAL_StatusTypeDef status;

    if (dest == NULL) {
        // send only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_Transmit(self->spi, (uint8_t *)src, len, timeout);
        } else {
            DMA_HandleTypeDef tx_dma;
            dma_init(&tx_dma, self->tx_dma_descr, DMA_MEMORY_TO_PERIPH, self->spi);
            self->spi->hdmatx = &tx_dma;
            self->spi->hdmarx = NULL;
            MP_HAL_CLEAN_DCACHE(src, len);
            uint32_t t_start = HAL_GetTick();
            do {
                uint32_t l = MIN(len, 65535);
                status = HAL_SPI_Transmit_DMA(self->spi, (uint8_t *)src, l);
                if (status != HAL_OK) {
                    break;
                }
                status = spi_wait_dma_finished(self, t_start, timeout);
                if (status != HAL_OK) {
                    break;
                }
                len -= l;
                src += l;
            } while (len);
            dma_deinit(self->tx_dma_descr);
        }
    } else if (src == NULL) {
        // receive only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_Receive(self->spi, dest, len, timeout);
        } else {
            DMA_HandleTypeDef tx_dma, rx_dma;
            if (self->spi->Init.Mode == SPI_MODE_MASTER) {
                // in master mode the HAL actually does a TransmitReceive call
                dma_init(&tx_dma, self->tx_dma_descr, DMA_MEMORY_TO_PERIPH, self->spi);
                self->spi->hdmatx = &tx_dma;
            } else {
                self->spi->hdmatx = NULL;
            }
            dma_init(&rx_dma, self->rx_dma_descr, DMA_PERIPH_TO_MEMORY, self->spi);
            self->spi->hdmarx = &rx_dma;
            MP_HAL_CLEANINVALIDATE_DCACHE(dest, len);
            uint32_t t_start = HAL_GetTick();
            do {
                uint32_t l = MIN(len, 65535);
                status = HAL_SPI_Receive_DMA(self->spi, dest, l);
                if (status != HAL_OK) {
                    break;
                }
                status = spi_wait_dma_finished(self, t_start, timeout);
                if (status != HAL_OK) {
                    break;
                }
                len -= l;
                dest += l;
            } while (len);
            if (self->spi->hdmatx != NULL) {
                dma_deinit(self->tx_dma_descr);
            }
            dma_deinit(self->rx_dma_descr);
        }
    } else {
        // send and receive
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_TransmitReceive(self->spi, (uint8_t *)src, dest, len, timeout);
            // XXXTODO Schedule transfer complete callback?
        } else {
            DMA_HandleTypeDef tx_dma, rx_dma;
            dma_init(&tx_dma, self->tx_dma_descr, DMA_MEMORY_TO_PERIPH, self->spi);
            self->spi->hdmatx = &tx_dma;
            dma_init(&rx_dma, self->rx_dma_descr, DMA_PERIPH_TO_MEMORY, self->spi);
            self->spi->hdmarx = &rx_dma;
            MP_HAL_CLEAN_DCACHE(src, len);
            MP_HAL_CLEANINVALIDATE_DCACHE(dest, len);
            uint32_t t_start = HAL_GetTick();
            do {
                uint32_t l = MIN(len, 65535);
                status = HAL_SPI_TransmitReceive_DMA(self->spi, (uint8_t *)src, dest, l);
                if (status != HAL_OK) {
                    break;
                }
                status = spi_wait_dma_finished(self, t_start, timeout);
                if (status != HAL_OK) {
                    break;
                }
                len -= l;
                src += l;
                dest += l;
            } while (len);
            dma_deinit(self->tx_dma_descr);
            dma_deinit(self->rx_dma_descr);
        }
    }

    self->spi->hdmatx = NULL; // indicate we are done
    self->spi->hdmarx = NULL;

    if (status != HAL_OK) {
        mp_hal_raise(status);
    }
}

#if SPIDMA_MODES


