micropython/micropython/ports/stm32/spi.c
int get_spi_id_from_Instance(const SPI_TypeDef *Instance){
    int spi_id = -1;
    
    // SPI_TypeDef * Instance = self->spi->Instance;

    if (0) {
    }
    #if defined(MICROPY_HW_SPI1_SCK)
    else if (Instance == SPI1) {
        spi_id = 1;
    }
    #endif
    #if defined(MICROPY_HW_SPI2_SCK)
    else if (Instance == SPI2) {
        spi_id = 2;
    }
    #endif
    #if defined(MICROPY_HW_SPI3_SCK)
    else if (Instance == SPI3) {
        spi_id = 3;
    }
    #endif
    #if defined(MICROPY_HW_SPI4_SCK)
    else if (Instance == SPI4) {
        spi_id = 4;
    }
    #endif
    #if defined(MICROPY_HW_SPI5_SCK)
    else if (Instance == SPI5) {
        spi_id = 5;
    }
    #endif
    #if defined(MICROPY_HW_SPI6_SCK)
    else if (Instance == SPI6) {
        spi_id = 6;
    }
    #endif

    return spi_id;
}

mp_obj_t get_mp_spi_id_from_Instance(const SPI_TypeDef *Instance){
    return mp_obj_new_int(get_spi_id_from_Instance(Instance));
}

void spi_transfer_nonblocking(const spi_t *self, size_t len, const uint8_t *src, uint8_t *dest, uint32_t timeout) {
    // Note: there seems to be a problem sending 1 byte using DMA the first
    // time directly after the SPI/DMA is initialised.  The cause of this is
    // unknown but we sidestep the issue by using polling for 1 byte transfer.
    #ifdef DEBUG_SPIDMA_MODES
        printf("\nspi_transfer_nonblocking enter\n");
    #endif
    // Note: DMA transfers are limited to 65535 bytes at a time.
    if (len > 65535){
        mp_raise_ValueError("SPI NONBLOCKING mode requires transfers to be less than 65536");
    }

    HAL_StatusTypeDef status;
    if (dest == NULL) {
        // send only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_Transmit(self->spi, (uint8_t *)src, len, timeout);
            // schedule callback if defined
            mp_obj_t callback;
            SPI_TypeDef *Instance = self->spi->Instance;
            if ((callback = self->dma_modes->callbackhalf) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
            if ((callback = self->dma_modes->callback) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
        } else {
            DMA_HandleTypeDef * tx_dma = &self->dma_modes->tx_dma;
            dma_init(tx_dma, self->tx_dma_descr, DMA_MEMORY_TO_PERIPH, self->spi);
            self->spi->hdmatx = tx_dma;
            self->spi->hdmarx = NULL;
            MP_HAL_CLEAN_DCACHE(src, len);
            status = HAL_SPI_Transmit_DMA(self->spi, (uint8_t *)src, len);
        }
    } else if (src == NULL) {
        // receive only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_Receive(self->spi, dest, len, timeout);
            // schedule callback if defined
            mp_obj_t callback;
            SPI_TypeDef *Instance = self->spi->Instance;
            if ((callback = self->dma_modes->callbackhalf) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
            if ((callback = self->dma_modes->callback) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
        } else {
            DMA_HandleTypeDef * tx_dma = &self->dma_modes->tx_dma;
            DMA_HandleTypeDef * rx_dma = &self->dma_modes->rx_dma;
            if (self->spi->Init.Mode == SPI_MODE_MASTER) {
                // in master mode the HAL actually does a TransmitReceive call
                dma_init(tx_dma, self->tx_dma_descr, DMA_MEMORY_TO_PERIPH, self->spi);
                self->spi->hdmatx = tx_dma;
            } else {
                self->spi->hdmatx = NULL;
            }
            dma_init(rx_dma, self->rx_dma_descr, DMA_PERIPH_TO_MEMORY, self->spi);
            self->spi->hdmarx = rx_dma;
            MP_HAL_CLEANINVALIDATE_DCACHE(dest, len);
            status = HAL_SPI_Receive_DMA(self->spi, dest, len);
        }
    } else {
        // send and receive
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_TransmitReceive(self->spi, (uint8_t *)src, dest, len, timeout);
            // schedule callback if defined
            mp_obj_t callback;
            SPI_TypeDef *Instance = self->spi->Instance;
            if ((callback = self->dma_modes->callbackhalf) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
            if ((callback = self->dma_modes->callback) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
        } else {
            DMA_HandleTypeDef * tx_dma = &self->dma_modes->tx_dma;
            DMA_HandleTypeDef * rx_dma = &self->dma_modes->rx_dma;

            // printf("\ntx mode = %d\n", (int) tx_dma->Init.Mode);
            // printf("\nrx mode = %d\n", (int) tx_dma->Init.Mode);
            
            dma_init(tx_dma, self->tx_dma_descr, DMA_MEMORY_TO_PERIPH, self->spi);
            self->spi->hdmatx = tx_dma;
            dma_init(rx_dma, self->rx_dma_descr, DMA_PERIPH_TO_MEMORY, self->spi);
            self->spi->hdmarx = rx_dma;
            MP_HAL_CLEAN_DCACHE(src, len);
            MP_HAL_CLEANINVALIDATE_DCACHE(dest, len);
            status = HAL_SPI_TransmitReceive_DMA(self->spi, (uint8_t *)src, dest, len);
        }
    }

    if (status != HAL_OK) {
        mp_hal_raise(status);
    }
}


void spi_transfer_circular(const spi_t *self, size_t len, const uint8_t *src, uint8_t *dest, uint32_t timeout) {
    // Note: there seems to be a problem sending 1 byte using DMA the first
    // time directly after the SPI/DMA is initialised.  The cause of this is
    // unknown but we sidestep the issue by using polling for 1 byte transfer.
    #ifdef DEBUG_SPIDMA_MODES
        printf("\nspi_transfer_circular\n");
    #endif
    // Note: DMA transfers are limited to 65535 bytes at a time.
    if (len > 65535){
        mp_raise_ValueError("SPI CIRCULAR mode requires transfers to be less than 65536");
    }

    HAL_StatusTypeDef status;
    if (dest == NULL) {
        // send only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_Transmit(self->spi, (uint8_t *)src, len, timeout);
            // schedule callback if defined
            mp_obj_t callback;
            SPI_TypeDef *Instance = self->spi->Instance;
            if ((callback = self->dma_modes->callbackhalf) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
            if ((callback = self->dma_modes->callback) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
        } else {
            DMA_HandleTypeDef * tx_dma = &self->dma_modes->tx_dma;
            dma_init(tx_dma, self->tx_dma_descr, DMA_MEMORY_TO_PERIPH, self->spi);
            self->spi->hdmatx = tx_dma;
            self->spi->hdmarx = NULL;
            MP_HAL_CLEAN_DCACHE(src, len);
            status = HAL_SPI_Transmit_DMA(self->spi, (uint8_t *)src, len);
        }
    } else if (src == NULL) {
        // receive only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_Receive(self->spi, dest, len, timeout);
            // schedule callback if defined
            mp_obj_t callback;
            SPI_TypeDef *Instance = self->spi->Instance;
            if ((callback = self->dma_modes->callbackhalf) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
            if ((callback = self->dma_modes->callback) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
        } else {
            DMA_HandleTypeDef * tx_dma = &self->dma_modes->tx_dma;
            DMA_HandleTypeDef * rx_dma = &self->dma_modes->rx_dma;
            if (self->spi->Init.Mode == SPI_MODE_MASTER) {
                // in master mode the HAL actually does a TransmitReceive call
                dma_init(tx_dma, self->tx_dma_descr, DMA_MEMORY_TO_PERIPH, self->spi);
                self->spi->hdmatx = tx_dma;
            } else {
                self->spi->hdmatx = NULL;
            }
            dma_init(rx_dma, self->rx_dma_descr, DMA_PERIPH_TO_MEMORY, self->spi);
            self->spi->hdmarx = rx_dma;
            MP_HAL_CLEANINVALIDATE_DCACHE(dest, len);
            status = HAL_SPI_Receive_DMA(self->spi, dest, len);
        }
    } else {
        // send and receive
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_TransmitReceive(self->spi, (uint8_t *)src, dest, len, timeout);
            // schedule callback if defined
            mp_obj_t callback;
            SPI_TypeDef *Instance = self->spi->Instance;
            if ((callback = self->dma_modes->callbackhalf) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
            if ((callback = self->dma_modes->callback) != (mp_obj_t) NULL){
                mp_call_function_1(callback, get_mp_spi_id_from_Instance(Instance));
            }
        } else {
            DMA_HandleTypeDef * tx_dma = &self->dma_modes->tx_dma;
            DMA_HandleTypeDef * rx_dma = &self->dma_modes->rx_dma;

