micropython/micropython/ports/stm32/spi.c
            tx_dma->Init.Mode = DMA_CIRCULAR;
            rx_dma->Init.Mode = DMA_CIRCULAR;
            
            // printf("\ntx mode = %d\n", (int) tx_dma->Init.Mode);
            // printf("\nrx mode = %d\n", (int) rx_dma->Init.Mode);


            // mode is tx_dma->Init.Mode;
            
            dma_init(tx_dma, self->tx_dma_descr, DMA_MEMORY_TO_PERIPH, self->spi);
            self->spi->hdmatx = tx_dma;
            dma_init(rx_dma, self->rx_dma_descr, DMA_PERIPH_TO_MEMORY, self->spi);
            self->spi->hdmarx = rx_dma;
            MP_HAL_CLEAN_DCACHE(src, len);
            MP_HAL_CLEANINVALIDATE_DCACHE(dest, len);
            status = HAL_SPI_TransmitReceive_DMA(self->spi, (uint8_t *)src, dest, len);
        }
    }

    if (status != HAL_OK) {
        mp_hal_raise(status);
    }
}
#endif

void spi_print(const mp_print_t *print, const spi_t *spi_obj, bool legacy) {
    SPI_HandleTypeDef *spi = spi_obj->spi;

    uint spi_num = 1; // default to SPI1
    if (0) {
    }
    #if defined(SPI2)
    else if (spi->Instance == SPI2) {
        spi_num = 2;
    }
    #endif
    #if defined(SPI3)
    else if (spi->Instance == SPI3) {
        spi_num = 3;
    }
    #endif
    #if defined(SPI4)
    else if (spi->Instance == SPI4) {
        spi_num = 4;
    }
    #endif
    #if defined(SPI5)
    else if (spi->Instance == SPI5) {
        spi_num = 5;
    }
    #endif
    #if defined(SPI6)
    else if (spi->Instance == SPI6) {
        spi_num = 6;
    }
    #endif

    // XXXTODO add print support for new SPIDMA_MODES
    mp_printf(print, "SPI(%u", spi_num);
    if (spi->State != HAL_SPI_STATE_RESET) {
        if (spi->Init.Mode == SPI_MODE_MASTER) {
            // compute baudrate
            uint log_prescaler = (spi->Init.BaudRatePrescaler >> 3) + 1;
            uint baudrate = spi_get_source_freq(spi) >> log_prescaler;
            if (legacy) {
                mp_printf(print, ", SPI.MASTER");
            }
            mp_printf(print, ", baudrate=%u", baudrate);
            if (legacy) {
                mp_printf(print, ", prescaler=%u", 1 << log_prescaler);
            }
        } else {
            mp_printf(print, ", SPI.SLAVE");
        }
        mp_printf(print, ", polarity=%u, phase=%u, bits=%u", spi->Init.CLKPolarity == SPI_POLARITY_LOW ? 0 : 1, spi->Init.CLKPhase == SPI_PHASE_1EDGE ? 0 : 1, spi->Init.DataSize == SPI_DATASIZE_8BIT ? 8 : 16);
        if (spi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE) {
            mp_printf(print, ", crc=0x%x", spi->Init.CRCPolynomial);
        }
    }
    mp_print_str(print, ")");
}

const spi_t *spi_from_mp_obj(mp_obj_t o) {
    if (mp_obj_is_type(o, &pyb_spi_type)) {
        pyb_spi_obj_t *self = MP_OBJ_TO_PTR(o);
        return self->spi;
    } else if (mp_obj_is_type(o, &machine_hard_spi_type)) {
        machine_hard_spi_obj_t *self = MP_OBJ_TO_PTR(o);
        return self->spi;
    } else {
        mp_raise_TypeError("expecting an SPI object");
    }
}

/******************************************************************************/
// Implementation of low-level SPI C protocol

STATIC int spi_proto_ioctl(void *self_in, uint32_t cmd) {
    spi_proto_cfg_t *self = (spi_proto_cfg_t *)self_in;

    switch (cmd) {
        case MP_SPI_IOCTL_INIT:
            self->spi->spi->Init.Mode = SPI_MODE_MASTER;
            self->spi->spi->Init.Direction = SPI_DIRECTION_2LINES;
            self->spi->spi->Init.NSS = SPI_NSS_SOFT;
            self->spi->spi->Init.TIMode = SPI_TIMODE_DISABLE;
            self->spi->spi->Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
#ifdef SPIDMA_MODES
            spi_set_params(self->spi, 0xffffffff, self->baudrate,
                self->polarity, self->phase, self->bits, self->firstbit,
                0xffffffff, (mp_obj_t) NULL, (mp_obj_t) NULL, (mp_obj_t) NULL, (mp_obj_t) NULL
                );
#else
            spi_set_params(self->spi, 0xffffffff, self->baudrate,
                self->polarity, self->phase, self->bits, self->firstbit);
#endif
            spi_init(self->spi, false);
            break;

        case MP_SPI_IOCTL_DEINIT:
            spi_deinit(self->spi);
            break;
    }

    return 0;
}

STATIC void spi_proto_transfer(void *self_in, size_t len, const uint8_t *src, uint8_t *dest) {
    spi_proto_cfg_t *self = (spi_proto_cfg_t *)self_in;
    spi_transfer(self->spi, len, src, dest, SPI_TRANSFER_TIMEOUT(len));
}

const mp_spi_proto_t spi_proto = {
    .ioctl = spi_proto_ioctl,
    .transfer = spi_proto_transfer,
};


#ifdef SPIDMA_MODES

STATIC void callcallback(mp_obj_t spi_id, mp_obj_t callback)
{
    // execute callback. vetted long before getting here.
    mp_sched_lock();
    // When executing code within a handler we must lock the GC to prevent
    // any memory allocations.  We must also catch any exceptions.
    gc_lock();
    nlr_buf_t nlr;
    if (nlr_push(&nlr) == 0) {
        mp_call_function_1(callback, spi_id);
        nlr_pop();
    } else {
        // Uncaught exception
        mp_printf(MICROPY_ERROR_PRINTER, "uncaught exception in SPI(%d) interrupt handler\n", spi_id);
        mp_obj_print_exception(&mp_plat_print, MP_OBJ_FROM_PTR(nlr.ret_val));
    }
    gc_unlock();
    mp_sched_unlock();
}

/**
  * @brief Tx and Rx Transfer completed callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
    // void led_toggle(int); /*void mp_hal_delay_ms(int);*/ while(1){led_toggle(1); mp_hal_delay_ms(500);}
    #ifdef DEBUG_SPIDMA_MODES
        printf("\ncalling HAL_SPI_TxRxCpltCallback\n");
    #endif

    SPI_TypeDef *Instance = hspi->Instance;
    int spi_id = get_spi_id_from_Instance(Instance);
    if (spi_id >= 0)
    {
        const spi_t * _spi = &spi_obj[spi_id-1];
        SPI_DMAHandleTypeDef * dma_modes = _spi->dma_modes;
        if (dma_modes){
            if (dma_modes->mode == SPI_CFG_MODE_NONBLOCKING){ // need to keep it going during CIRCULAR mode.
                if (hspi->hdmatx != NULL){
                    dma_deinit(_spi->tx_dma_descr);
                    hspi->hdmatx = NULL; // So we know there is no longer a DMA in process
                }
                if (hspi->hdmarx != NULL){
                    dma_deinit(_spi->rx_dma_descr);
                    hspi->hdmarx = NULL;
                }
            }
            mp_obj_t callback = dma_modes->callback;
            if (callback != (mp_obj_t) NULL){
                callcallback(mp_obj_new_int(spi_id), callback);
            }
        }
    }
}


/**
  * @brief Tx Transfer completed callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
    SPI_TypeDef *Instance = hspi->Instance;
    int spi_id = get_spi_id_from_Instance(Instance);
    if (spi_id >= 0)
    {
        const spi_t * _spi = &spi_obj[spi_id-1];
        SPI_DMAHandleTypeDef * dma_modes = _spi->dma_modes;
        if (dma_modes){
            if (dma_modes->mode == SPI_CFG_MODE_NONBLOCKING){ // need to keep it going during CIRCULAR mode.
                dma_deinit(_spi->tx_dma_descr);
                if (hspi->hdmarx != NULL){
                    dma_deinit(_spi->rx_dma_descr);
                    hspi->hdmarx = NULL;
                }
                hspi->hdmatx = NULL; // So we know there is no longer a DMA in process
            }
            mp_obj_t callback = dma_modes->callback;
            if (callback != (mp_obj_t) NULL){
                callcallback(mp_obj_new_int(spi_id), callback);
            }
        }
    }
}

/**
  * @brief Rx Transfer completed callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
    SPI_TypeDef *Instance = hspi->Instance;
    int spi_id = get_spi_id_from_Instance(Instance);
    if (spi_id >= 0)
    {
        const spi_t * _spi = &spi_obj[spi_id-1];
        SPI_DMAHandleTypeDef * dma_modes = _spi->dma_modes;
        if (dma_modes){
            if (dma_modes->mode == SPI_CFG_MODE_NONBLOCKING){ // need to keep it going during CIRCULAR mode.
                dma_deinit(_spi->rx_dma_descr);
                if (hspi->hdmatx != NULL){
                    dma_deinit(_spi->tx_dma_descr);
                    hspi->hdmatx = NULL; // So we know there is no longer a DMA in process
                }
                hspi->hdmarx = NULL;
            }
            mp_obj_t callback = dma_modes->callback;
            if (callback != (mp_obj_t) NULL){
                callcallback(mp_obj_new_int(spi_id), callback);
            }
        }
    }
}


/**
  * @brief Tx and Rx Half Transfer callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_TxRxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
    // void led_toggle(int); /*void mp_hal_delay_ms(int);*/ while(1){led_toggle(2); mp_hal_delay_ms(500);}
    #ifdef DEBUG_SPIDMA_MODES
        printf("\nHAL_SPI_TxRxHalfCpltCallback called\n");
    #endif
    
