micropython/micropython/ports/stm32/spi.c
    SPI_TypeDef *Instance = hspi->Instance;
    int spi_id = get_spi_id_from_Instance(Instance);
    
    if (spi_id >= 0)
    {
        const spi_t * _spi = &spi_obj[spi_id-1];
        SPI_DMAHandleTypeDef * dma_modes = _spi->dma_modes;
        if (dma_modes){
            mp_obj_t callback = dma_modes->callbackhalf;
            if (callback != (mp_obj_t) NULL){
                callcallback(mp_obj_new_int(spi_id), callback);
            }
        }
    }
}

/**
  * @brief Tx Half Transfer completed callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_TxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
    #ifdef DEBUG_SPIDMA_MODES
        printf("\nHAL_SPI_TxHalfCpltCallback called\n");
    #endif
    
    HAL_SPI_TxRxHalfCpltCallback(hspi);
}

/**
  * @brief Rx Half Transfer completed callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_RxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
    #ifdef DEBUG_SPIDMA_MODES
        printf("\nHAL_SPI_RxHalfCpltCallback called\n");
    #endif
    HAL_SPI_TxRxHalfCpltCallback(hspi);
}



/**
  * @brief SPI error callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
    #ifdef DEBUG_SPIDMA_MODES
        printf("\nHAL_SPI_ErrorCallback called\n");
    #endif

    /* NOTE : The ErrorCode parameter in the hspi handle is updated by the SPI processes
            and user can use HAL_SPI_GetError() API to check the latest error occurred
    */
    SPI_TypeDef *Instance = hspi->Instance;
    int spi_id = get_spi_id_from_Instance(Instance);
    if (spi_id >= 0)
    {
        SPI_DMAHandleTypeDef * dma_modes = spi_obj[spi_id-1].dma_modes;
        if (dma_modes){
            mp_obj_t callback = dma_modes->callbackerror;
            if (callback != (mp_obj_t) NULL){
                callcallback(mp_obj_new_int(spi_id), callback);
            }
        }
    }
}
#endif